Repository: carlosnp/ecommerces
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Add the Locale middleware in the correct position, to be able to determine the user’s language preferences through the request context
es: Agregue el middleware Locale en la posición correcta, para poder determinar las preferencias de idioma del usuario a través de la solicitud del contexto

source: Add the Template context processor
es: Añada el procesador de contexto de las plantillas

source: At the beginning of the template you must add
es: Al inicio de la plantilla se debe agregar

source: Configuration settings.py
es: Configuración settings.py

source: Configuration templates
es: Configuración de plantillas

source: Configuration traslation
es: Configuración de la Traducción

source: Configuration urls.py
es: Configuración urls.py

source: Define locale files
es: Defina los archivos de configuración regional

source: Go to the terminal
es: Ve al terminal

source: is used for extended content, we will use it for a paragraph
es: se usa para contenido extendido, lo usaremos para un párrafo

source: is used to translate a single line, we will use it for the title
es: se usa para traducir una sola línea, la usaremos para el título

source: Specify the languages you want to use
es: Especifique los idiomas que desea utilizar

source: To compile all the messages and their translations of the django.po file
es: Para compilar todos los mensajes y sus traducciones del archivo django.po

source: To create the directory(locale/language) and the message file(django.po) for the language we want to translate
es: Para crear el directorio (locale/language) y el archivo de mensaje (django.po) para el idioma que queremos traducir

source: We will use two different template tags
es: Usaremos dos etiquetas diferentes en las plantillas.

source: About
es: Acerca de

source: Disabled
es: Acceso desactivado

source: Features
es: Caracteristicas

source: Internationalization
es: Internacionalización

source: Home
es: Inicio

source: Pricing
es: Precios

source: Home Page
es: Página de Inicio

source: English
es: Inglés

source: Spanish
es: Español
